
read_verilog -sv ../MODEL/SPI_EXE_UNIT_4/*.sv

synth
abc -g AND,OR,XOR
opt_clean

flatten 

copy spi_exe_unit_4 spi_exe_unit_4_rtl
select *
select -del spi_exe_unit_4_rtl
delete
select *

write_verilog -noattr ../RTL/spi_exe_unit_4_rtl.sv

